{
  "trap_clauses": [
    { "id": 1, "text": "This Agreement will automatically renew for successive one-year terms unless cancelled in writing 30 days prior to the renewal date." },
    { "id": 2, "text": "We reserve the right to modify these Terms at any time without prior notice to you." },
    { "id": 3, "text": "By continuing to use the Service, you agree to any changes made to this Agreement." },
    { "id": 4, "text": "You agree to resolve any disputes exclusively through binding arbitration and waive your right to a trial by jury." },
    { "id": 5, "text": "The Company may terminate this Agreement at its sole discretion without notice or cause." },
    { "id": 6, "text": "Failure to cancel the subscription before the trial ends will result in automatic billing of the full monthly rate." },
    { "id": 7, "text": "You authorize us to charge any applicable fees, including late payment or processing charges, to your default payment method." },
    { "id": 8, "text": "We may collect, use, and share your personal information with third parties for marketing purposes without additional consent." },
    { "id": 9, "text": "We are not responsible for any damages, including incidental or consequential damages, arising from the use of this service." },
    { "id": 10, "text": "You agree to indemnify and hold harmless the Company and its affiliates from any claims or damages resulting from your use of the Service." },
    { "id": 11, "text": "All intellectual property rights remain with the Company, including any content or feedback submitted by you." },
    { "id": 12, "text": "We may suspend or limit your access to the Service for any reason, without liability or notice." },
    { "id": 13, "text": "You waive your right to participate in any class action or representative lawsuit." },
    { "id": 14, "text": "Any dispute shall be governed exclusively by the laws of [State/Country], without regard to its conflict of law provisions." },
    { "id": 15, "text": "We are not obligated to provide refunds under any circumstances." },
    { "id": 16, "text": "You acknowledge that prices, features, and availability are subject to change without notice." },
    { "id": 17, "text": "We are not responsible for the accuracy, completeness, or reliability of any third-party content or links." },
    { "id": 18, "text": "Use of the Service is at your sole risk and provided on an 'as is' and 'as available' basis." },
    { "id": 19, "text": "We may assign or transfer this Agreement without your consent." },
    { "id": 20, "text": "You may not assign or transfer your rights under this Agreement without our prior written approval." },
    { "id": 21, "text": "By clicking 'I Agree,' you consent to receiving promotional emails and communications from our partners." },
    { "id": 22, "text": "You agree that your data may be transferred to and stored in jurisdictions with less protective privacy laws." },
    { "id": 23, "text": "We reserve the right to deny service to anyone for any reason at any time." },
    { "id": 24, "text": "Your continued use of the product constitutes your agreement to these and any future terms." },
    { "id": 25, "text": "You are solely responsible for complying with all applicable laws and regulations when using this service." },
    { "id": 26, "text": "By using this app, you grant us access to your contacts, camera, microphone, and location even when not in use." },
    { "id": 27, "text": "We may continue to use and store your data even after you delete your account." },
    { "id": 28, "text": "You agree that any content you upload becomes the property of the platform and may be used for promotional or commercial purposes." },
    { "id": 29, "text": "We may send push notifications and SMS messages for marketing purposes, which you cannot opt out of." },
    { "id": 30, "text": "Your data may be combined with information from public sources or third parties to build a user profile." },
    { "id": 31, "text": "You agree that we may share anonymized or aggregated data with our business partners without limitation." },
    { "id": 32, "text": "This device automatically transmits usage data and diagnostic reports to the manufacturer." },
    { "id": 33, "text": "We may throttle, limit, or reduce the quality of your service at our discretion during peak usage." },
    { "id": 34, "text": "By participating in this offer, you agree to enroll in a monthly subscription after the trial ends." },
    { "id": 35, "text": "You are responsible for monitoring changes to these terms, which will be posted on our website." },
    { "id": 36, "text": "Refunds are only available in the form of store credit and are subject to our approval." },
    { "id": 37, "text": "In the event of a dispute, our determination will be final and binding." },
    { "id": 38, "text": "We reserve the right to change the pricing of our services at any time without notifying you." },
    { "id": 39, "text": "This app continues to run in the background and collects activity data even when closed." },
    { "id": 40, "text": "Your uploaded photos may be used to train our AI systems." },
    { "id": 41, "text": "We may access, read, preserve, and disclose any information we believe is necessary to comply with legal obligations or protect our interests." },
    { "id": 42, "text": "By accepting this offer, you agree to receive promotional calls from our affiliates, regardless of your DND registration." },
    { "id": 43, "text": "Your purchase includes automatic enrollment in our extended warranty plan at an additional monthly cost." },
    { "id": 44, "text": "We may automatically install updates or features that alter how the product functions." },
    { "id": 45, "text": "You agree that any disputes will be resolved individually and not as part of a class, consolidated, or representative action." },
    { "id": 46, "text": "We do not guarantee compatibility of this product with future versions of your operating system." },
    { "id": 47, "text": "You acknowledge that the availability of features may vary based on geographic location or third-party restrictions." },
    { "id": 48, "text": "We are not responsible for any loss, damage, or injury caused by the use or misuse of our product." },
    { "id": 49, "text": "You agree to waive any rights you may have under applicable data protection or privacy laws." },
    { "id": 50, "text": "This app requires access to your social media accounts to function properly." }
  ]
}

